{
  "Soup": [
    {
      "title": "Cranberry Lime Bliss Balls",
      "category": "Snack",
      "time": "20 mins",
      "discription": "Cranberry lime bliss balls are a delightful and nutritious snack that combines the tangy flavors of cranberries with the zesty taste of lime. These no-bake bliss balls are easy to make and packed with natural sweetness and goodness.",
      "img": "https://cdn.pickuplimes.com/cache/db/6b/db6b7a326eed9542c98fd39ee012966b.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/35/4b/354b85572bde0ee94ccf22f882330320.jpg",
        "https://cdn.pickuplimes.com/cache/27/78/2778d5f1d592c2ca209fe6c675d1d0e8.jpg",
        "https://cdn.pickuplimes.com/cache/c0/f2/c0f2346813b6e5eea39dd9351e0bdc55.jpg",
        "https://cdn.pickuplimes.com/cache/f4/fe/f4fed13a76e234445fafea0d25828bfc.jpg"
      ],
      "directions": [
        "In a food processor, combine the dried cranberries, almonds, shredded coconut, lime zest, lime juice, maple syrup, vanilla extract, and a pinch of salt.",
        "Pulse the ingredients until they are well combined and form a sticky dough.",
        "If the mixture is too dry, you can add a bit more lime juice or maple syrup to reach the desired consistency.",
        "Line a baking sheet or tray with parchment paper.",
        "Using your hands, roll the cranberry lime mixture into bite-sized balls and place them on the prepared baking sheet.",
        "If desired, you can roll the bliss balls in additional shredded coconut for a decorative coating.",
        "Once all the mixture is used and shaped into balls, refrigerate the bliss balls for about 10-15 minutes to firm up.",
        "After chilling, the cranberry lime bliss balls are ready to be enjoyed!",
        "Store any leftovers in an airtight container in the refrigerator for up to a week.",
        "Grab these delicious and nutritious cranberry lime bliss balls as a quick and satisfying snack on the go or anytime you crave a burst of flavor."
      ],
      "ingredients": [
        {
          "ingredient": "Dried cranberries",
          "unit": "cups",
          "quantity": 1
        },
        {
          "ingredient": "Almonds",
          "unit": "cups",
          "quantity": 0.5
        },
        {
          "ingredient": "Shredded coconut (unsweetened)",
          "unit": "cups",
          "quantity": 0.5
        },
        {
          "ingredient": "Lime zest",
          "unit": "teaspoons",
          "quantity": 2
        },
        {
          "ingredient": "Lime juice",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Maple syrup",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Vanilla extract",
          "unit": "teaspoons",
          "quantity": 1
        },
        {
          "ingredient": "Pinch of salt",
          "unit": "pinch",
          "quantity": null
        },
        {
          "ingredient": "Additional shredded coconut (for rolling, optional)",
          "unit": "for rolling",
          "quantity": null
        }
      ]
    },
    {
      "title": "Potato Crisps with Creamy Tahini Dill Dip",
      "category": "Snack",
      "time": "30 mins",
      "discription": "Potato crisps with creamy tahini dill dip are a delightful and flavorful snack that combines the crispy goodness of potato chips with a creamy and tangy dip. This homemade version is much healthier and tastier than store-bought chips, making it perfect for parties or a satisfying treat anytime.",
      "img": "https://cdn.pickuplimes.com/cache/1d/32/1d32a53fc431acf97ff39c49fd2ddbd6.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/c5/5e/c55eb7e5882f2c2169f5a29b208bf050.jpg",
        "https://cdn.pickuplimes.com/cache/12/46/1246fd238d7ccc586d7ebf32293045cf.jpg",
        "https://cdn.pickuplimes.com/cache/5b/e6/5be619f1f262b67ae81a6231a6f266e6.jpg",
        "https://cdn.pickuplimes.com/cache/3e/2d/3e2dd9361117c9fc4c709acedca2844e.jpg"
      ],
      "directions": [
        "Preheat your oven to 400°F (200°C) and line a baking sheet with parchment paper.",
        "Wash and slice the potatoes into thin rounds using a sharp knife or a mandoline slicer for even thickness.",
        "In a large bowl, toss the potato slices with olive oil, sea salt, and black pepper until they are well coated.",
        "Arrange the potato slices in a single layer on the prepared baking sheet, making sure they do not overlap.",
        "Bake the potato crisps in the preheated oven for about 20-25 minutes or until they are golden and crispy. Flip them halfway through baking to ensure even cooking.",
        "While the potato crisps are baking, prepare the creamy tahini dill dip.",
        "In a small bowl, whisk together the tahini, chopped fresh dill, lemon juice, garlic powder, water, and salt and pepper to taste.",
        "Adjust the seasoning and consistency of the dip according to your preference by adding more lemon juice, water, or salt and pepper.",
        "Once the potato crisps are done, remove them from the oven and let them cool slightly.",
        "Serve the potato crisps with the creamy tahini dill dip, and enjoy this delicious and healthier alternative to traditional chips and dip.",
        "Store any leftover potato crisps in an airtight container for a crispy snack later.",
        "Refrigerate any remaining dip in a sealed container for up to a week."
      ],
      "ingredients": [
        {
          "ingredient": "Potatoes (russet or Yukon gold)",
          "unit": "large",
          "quantity": 3
        },
        {
          "ingredient": "Olive oil",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Sea salt",
          "unit": "teaspoons",
          "quantity": 1
        },
        {
          "ingredient": "Black pepper",
          "unit": "teaspoons",
          "quantity": 0.5
        },
        {
          "ingredient": "Tahini",
          "unit": "cup",
          "quantity": 0.5
        },
        {
          "ingredient": "Fresh dill, chopped",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Lemon juice",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Garlic powder",
          "unit": "teaspoons",
          "quantity": 0.5
        },
        {
          "ingredient": "Water",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Salt and pepper",
          "unit": "to taste",
          "quantity": null
        }
      ]
    },
    {
      "title": "Chocolate Chia Breakfast Pudding",
      "category": "Snack",
      "time": "10 mins",
      "discription": "Chocolate chia breakfast pudding is a nutritious and delicious way to start your day. This creamy and indulgent pudding is packed with chia seeds, which provide a boost of fiber, protein, and omega-3 fatty acids. Enjoy this delightful treat for breakfast or as a satisfying dessert.",
      "img": "https://cdn.pickuplimes.com/cache/c3/50/c350d0aa085dda7a12465d2d36f3bcd5.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/2c/82/2c82ebf446c5b2246986bce7af500baf.jpg",
        "https://cdn.pickuplimes.com/cache/98/b5/98b5810fbc03ce679d05d1a3eafc8e6f.jpg",
        "https://cdn.pickuplimes.com/cache/67/67/67671c7b95c0a6e74366462ee5982371.jpg",
        "https://cdn.pickuplimes.com/cache/a8/2c/a82cea50ae34e7e45a29507e5c6a2361.jpg"
      ],
      "directions": [
        "In a bowl or jar, combine the chia seeds, cocoa powder, maple syrup or agave syrup, and vanilla extract.",
        "Pour the almond milk (or any non-dairy milk of your choice) into the bowl and mix well until all the ingredients are fully combined.",
        "Cover the bowl or jar with a lid or plastic wrap and refrigerate it overnight or for at least 4-6 hours to allow the chia seeds to absorb the liquid and thicken into a pudding-like consistency.",
        "Before serving, give the chocolate chia pudding a good stir to ensure an even texture.",
        "Divide the pudding into individual serving cups or bowls.",
        "If desired, top the chocolate chia breakfast pudding with fresh berries, sliced bananas, chopped nuts or seeds, and coconut flakes for added flavor and texture.",
        "Enjoy the creamy and chocolaty goodness of this nutritious pudding for a delightful breakfast or a guilt-free dessert!",
        "Store any leftover chocolate chia breakfast pudding in the refrigerator for up to three days."
      ],
      "ingredients": [
        {
          "ingredient": "Chia seeds",
          "unit": "cups",
          "quantity": 0.25
        },
        {
          "ingredient": "Cocoa powder",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Maple syrup or agave syrup",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Vanilla extract",
          "unit": "teaspoons",
          "quantity": 1
        },
        {
          "ingredient": "Almond milk (or any non-dairy milk)",
          "unit": "cups",
          "quantity": 1
        },
        {
          "ingredient": "Fresh berries or sliced bananas (for topping, optional)",
          "unit": "for topping",
          "quantity": null
        },
        {
          "ingredient": "Chopped nuts or seeds (for topping, optional)",
          "unit": "for topping",
          "quantity": null
        },
        {
          "ingredient": "Coconut flakes (for topping, optional)",
          "unit": "for topping",
          "quantity": null
        }
      ]
    },
    {
      "title": "One-Bowl Chocolate Banana Bread",
      "category": "Snack",
      "time": "20 mins",
      "discription": "One-bowl chocolate banana bread is a delightful and moist treat that combines the rich flavor of chocolate with the natural sweetness of ripe bananas. This easy-to-make banana bread recipe requires only one bowl, making cleanup a breeze. Enjoy a slice of this delicious bread as a snack, dessert, or a comforting breakfast option.",
      "img": "https://cdn.pickuplimes.com/cache/ed/82/ed8210253ffd0433848061a9fe245347.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/8c/5b/8c5b3a26b621a8aa0a5e44616217c9ec.jpg",
        "https://cdn.pickuplimes.com/cache/66/3b/663b1f70a27a03083291779333181f29.jpg",
        "https://cdn.pickuplimes.com/cache/99/07/9907ef5cdf12d463349f0b8d38611dc5.jpg",
        "https://cdn.pickuplimes.com/cache/82/21/82212cba96382db2ed35f195959e36bc.jpg"
      ],
      "directions": [
        "Preheat your oven to 350°F (175°C) and grease a 9x5-inch loaf pan.",
        "In a large mixing bowl, mash the ripe bananas with a fork until smooth.",
        "Add the vegetable oil, brown sugar, and vanilla extract to the mashed bananas, and mix well until everything is well combined.",
        "Add the all-purpose flour, cocoa powder, baking powder, baking soda, and salt to the bowl with the wet ingredients.",
        "Gently fold the dry ingredients into the wet ingredients until just combined. Be careful not to overmix.",
        "Stir in the chocolate chips and chopped walnuts, if using, until evenly distributed throughout the batter.",
        "Pour the batter into the greased loaf pan and spread it out evenly.",
        "Bake the one-bowl chocolate banana bread in the preheated oven for about 50-60 minutes or until a toothpick inserted into the center comes out clean.",
        "Remove the bread from the oven and let it cool in the pan for about 10 minutes.",
        "Carefully transfer the bread to a wire rack to cool completely before slicing and serving.",
        "Enjoy a slice of this delicious and moist chocolate banana bread as a delightful snack or dessert!",
        "Store any leftover bread in an airtight container at room temperature for up to three days."
      ],
      "ingredients": [
        {
          "ingredient": "Ripe bananas, mashed",
          "unit": "cups",
          "quantity": 1.5
        },
        {
          "ingredient": "Vegetable oil",
          "unit": "cup",
          "quantity": 0.3333333333333333
        },
        {
          "ingredient": "Brown sugar",
          "unit": "cup",
          "quantity": 0.5
        },
        {
          "ingredient": "Vanilla extract",
          "unit": "teaspoon",
          "quantity": 1
        },
        {
          "ingredient": "All-purpose flour",
          "unit": "cups",
          "quantity": 1.5
        },
        {
          "ingredient": "Cocoa powder",
          "unit": "cup",
          "quantity": 0.3333333333333333
        },
        {
          "ingredient": "Baking powder",
          "unit": "teaspoon",
          "quantity": 0.5
        },
        {
          "ingredient": "Baking soda",
          "unit": "teaspoon",
          "quantity": 0.5
        },
        {
          "ingredient": "Salt",
          "unit": "teaspoon",
          "quantity": 0.25
        },
        {
          "ingredient": "Chocolate chips",
          "unit": "cup",
          "quantity": 0.5
        },
        {
          "ingredient": "Chopped walnuts (optional)",
          "unit": "cup",
          "quantity": 0.25
        }
      ]
    },
    {
      "title": "Easy Chunky Guacamole",
      "category": "Snack",
      "time": "15 mins",
      "discription": "Easy chunky guacamole is a simple and flavorful dip that celebrates the creaminess of ripe avocados and the freshness of tomatoes, onions, and cilantro. This guacamole is quick to prepare and perfect for dipping tortilla chips, adding to tacos, or as a delicious accompaniment to your favorite Mexican dishes.",
      "img": "https://cdn.pickuplimes.com/cache/fa/55/fa5519cd8822c4e079b45e03a5a39d54.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/ed/19/ed190cfe5069cbd8ceaffb8e2c8aa44e.jpg",
        "https://cdn.pickuplimes.com/cache/fc/63/fc6324d3bbf2bfedcbbeaca0bdd04205.jpg",
        "https://cdn.pickuplimes.com/cache/5b/bd/5bbd4eb5edf49df51b2b56e7566d8836.jpg",
        "https://cdn.pickuplimes.com/cache/7f/8b/7f8b5f12aca7d356377c16dc7d2bc9e3.jpg"
      ],
      "directions": [
        "Cut the ripe avocados in half, remove the pits, and scoop the flesh into a mixing bowl.",
        "Mash the avocados with a fork or potato masher to achieve your desired level of chunkiness.",
        "Add the diced tomato, finely chopped red onion, and fresh cilantro to the bowl with the mashed avocados.",
        "Squeeze in the lime juice to add brightness and prevent the avocados from browning.",
        "Sprinkle in the garlic powder, salt, and black pepper for extra flavor.",
        "For some heat, you can add finely chopped jalapeno to the guacamole.",
        "Gently stir all the ingredients together until well combined.",
        "Taste the guacamole and adjust the seasoning or lime juice if needed.",
        "Transfer the chunky guacamole to a serving bowl and garnish with a sprig of cilantro or a few tomato slices.",
        "Serve the easy chunky guacamole with your favorite tortilla chips or as a delicious topping for tacos, burritos, or any Mexican-inspired dish!",
        "Any leftovers can be stored in an airtight container in the refrigerator for up to a day. Enjoy it fresh for the best flavor and texture."
      ],
      "ingredients": [
        {
          "ingredient": "Ripe avocados",
          "unit": "2",
          "quantity": null
        },
        {
          "ingredient": "Tomato, diced",
          "unit": "1",
          "quantity": null
        },
        {
          "ingredient": "Red onion, finely chopped",
          "unit": "1/4 cup",
          "quantity": null
        },
        {
          "ingredient": "Fresh cilantro, chopped",
          "unit": "2 tablespoons",
          "quantity": null
        },
        {
          "ingredient": "Lime juice",
          "unit": "2 tablespoons",
          "quantity": null
        },
        {
          "ingredient": "Garlic powder",
          "unit": "1/2 teaspoon",
          "quantity": null
        },
        {
          "ingredient": "Salt",
          "unit": "1/2 teaspoon",
          "quantity": null
        },
        {
          "ingredient": "Black pepper",
          "unit": "1/4 teaspoon",
          "quantity": null
        },
        {
          "ingredient": "Optional: Jalapeno, finely chopped (for heat)",
          "unit": "1/2",
          "quantity": null
        }
      ]
    },
    {
      "title": "Chewy No-Bake Peanut Butter Dark Chocolate Oat Bars",
      "category": "Snack",
      "time": "10 mins",
      "discription": "Chewy no-bake peanut butter dark chocolate oat bars are a delightful and energy-boosting treat that requires minimal effort to make. These bars combine the rich flavors of peanut butter and dark chocolate with the wholesome goodness of oats, creating a satisfying and delicious snack for any time of the day.",
      "img": "https://cdn.pickuplimes.com/cache/55/65/5565540b32a3e1bc3e4be475d473b7cd.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/52/ee/52eef76899709a973222d9d5b7f15cae.jpg",
        "https://cdn.pickuplimes.com/cache/cd/0f/cd0f9524910279f63f4d45a586e2911b.jpg",
        "https://cdn.pickuplimes.com/cache/17/7a/177ab14057fc88cbd16f98cec97bd194.jpg",
        "https://cdn.pickuplimes.com/cache/0f/90/0f904bdc5b7b015c0fb8c702e8ad1e52.jpg"
      ],
      "directions": [
        "Line an 8x8-inch square baking dish with parchment paper, leaving some overhang on the sides for easy removal of the bars later.",
        "In a microwave-safe bowl or on the stovetop, gently melt the creamy peanut butter, maple syrup, and coconut oil together until they form a smooth mixture.",
        "Stir in the vanilla extract and a pinch of salt for added flavor.",
        "Add the quick oats to the peanut butter mixture and mix until all the oats are well coated.",
        "Gently fold in the dark chocolate chips, distributing them evenly throughout the mixture.",
        "Transfer the oat mixture to the prepared baking dish and press it down firmly using the back of a spoon or your hands to create an even layer.",
        "For best results, refrigerate the bars for at least 2 hours or until they are firm and set.",
        "Once the bars have chilled and set, lift them out of the baking dish using the parchment paper overhang.",
        "Place the slab of bars on a cutting board and cut them into desired sizes.",
        "Serve these delicious and chewy no-bake peanut butter dark chocolate oat bars as a satisfying snack or a sweet treat anytime you need an energy boost.",
        "Store any leftover bars in an airtight container in the refrigerator for up to a week."
      ],
      "ingredients": [
        {
          "ingredient": "Creamy peanut butter",
          "unit": "cups",
          "quantity": 1
        },
        {
          "ingredient": "Maple syrup",
          "unit": "cups",
          "quantity": 0.5
        },
        {
          "ingredient": "Coconut oil",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Vanilla extract",
          "unit": "teaspoons",
          "quantity": 1
        },
        {
          "ingredient": "Quick oats",
          "unit": "cups",
          "quantity": 2
        },
        {
          "ingredient": "Dark chocolate chips",
          "unit": "cups",
          "quantity": 0.5
        },
        {
          "ingredient": "Salt",
          "unit": "pinch",
          "quantity": null
        }
      ]
    },
    {
      "title": "Vegan Caramel Popcorn",
      "category": "Snack",
      "time": "30 mins",
      "discription": "Vegan caramel popcorn is a delightful and addictive snack that combines the classic crunch of popcorn with a sweet and gooey caramel coating. This homemade version of caramel popcorn is made without any dairy or animal products, making it a perfect treat for vegans and non-vegans alike.",
      "img": "https://cdn.pickuplimes.com/cache/d4/57/d457e16401863ba31ac04f89f6074b02.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/8c/95/8c951040eba66bf377efdd2504cf6276.jpg",
        "https://cdn.pickuplimes.com/cache/d9/27/d92790e74b1ff283022b10d309d9b00f.jpg",
        "https://cdn.pickuplimes.com/cache/3a/15/3a15f9c8f249342f3e14648b4052a292.jpg",
        "https://cdn.pickuplimes.com/cache/72/03/7203659d835e3612f7c954a199d522b3.jpg"
      ],
      "directions": [
        "Preheat your oven to 250°F (120°C) and line a large baking sheet with parchment paper.",
        "Spread the popped popcorn evenly on the prepared baking sheet, ensuring there are no large clumps.",
        "In a saucepan over medium heat, melt the vegan butter.",
        "Stir in the brown sugar, maple syrup or agave syrup, vanilla extract, baking soda, and salt.",
        "Bring the mixture to a boil and let it bubble for about 4-5 minutes, stirring occasionally, until it thickens and turns into a caramel sauce.",
        "Remove the saucepan from the heat and carefully pour the hot caramel sauce over the popped popcorn.",
        "Using a spatula or spoon, gently toss the popcorn to evenly coat it with the caramel sauce.",
        "Bake the caramel-coated popcorn in the preheated oven for 15-20 minutes, stirring it every 5 minutes to ensure even coating and prevent burning.",
        "Remove the caramel popcorn from the oven and let it cool completely on the baking sheet. The caramel will continue to harden as it cools.",
        "Once the caramel popcorn has cooled and hardened, break it into bite-sized clusters.",
        "Serve this addictive vegan caramel popcorn as a delicious snack for movie nights, parties, or any time you crave a sweet and crunchy treat!",
        "Store any leftover caramel popcorn in an airtight container at room temperature for up to a week."
      ],
      "ingredients": [
        {
          "ingredient": "Popped popcorn",
          "unit": "cups",
          "quantity": 8
        },
        {
          "ingredient": "Vegan butter",
          "unit": "cup",
          "quantity": 0.5
        },
        {
          "ingredient": "Brown sugar",
          "unit": "cup",
          "quantity": 0.5
        },
        {
          "ingredient": "Maple syrup or agave syrup",
          "unit": "cup",
          "quantity": 0.25
        },
        {
          "ingredient": "Vanilla extract",
          "unit": "teaspoon",
          "quantity": 1
        },
        {
          "ingredient": "Baking soda",
          "unit": "teaspoon",
          "quantity": 0.25
        },
        {
          "ingredient": "Salt",
          "unit": "teaspoon",
          "quantity": 0.25
        }
      ]
    },
    {
      "title": "Pistachio & Cranberry Energy Balls",
      "category": "Snack",
      "time": "15 mins",
      "discription": "Pistachio & cranberry energy balls are a nutritious and tasty snack that provides a burst of energy and a delightful combination of flavors. These no-bake energy balls are easy to make and are packed with wholesome ingredients like pistachios, cranberries, and dates, making them a perfect on-the-go snack or a quick pick-me-up during the day.",
      "img": "https://cdn.pickuplimes.com/cache/ca/03/ca032015aea96fca14c253efd5a0651d.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/4f/0f/4f0f1f46d69bd831585e09fa713a8450.jpg",
        "https://cdn.pickuplimes.com/cache/ba/04/ba04a5ebd3344349de32961d225157fb.jpg",
        "https://cdn.pickuplimes.com/cache/9f/a9/9fa9d29eb6a6a15734044df8dfc08326.jpg",
        "https://cdn.pickuplimes.com/cache/72/92/72921f6055ce9df02dbed7c429d283a4.jpg"
      ],
      "directions": [
        "In a food processor, combine the pistachios, dried cranberries, pitted Medjool dates, rolled oats, chia seeds, and vanilla extract.",
        "Pulse the mixture until the ingredients are finely chopped and well combined.",
        "Add the water to the food processor and continue pulsing until the mixture starts to come together into a sticky dough.",
        "If the mixture is too dry, you can add a bit more water, one tablespoon at a time, until the desired consistency is achieved.",
        "Transfer the dough to a bowl and refrigerate it for about 10-15 minutes to make it easier to handle.",
        "After chilling, take small portions of the dough and roll them into bite-sized balls between your palms.",
        "Optional: Roll the energy balls in shredded coconut to add a delicious coating.",
        "Place the pistachio & cranberry energy balls on a plate or tray lined with parchment paper.",
        "Refrigerate the energy balls for at least 30 minutes to firm up.",
        "Once the energy balls are chilled and firm, transfer them to an airtight container for storage.",
        "Enjoy these nutritious and flavorful pistachio & cranberry energy balls as a quick and satisfying snack anytime you need an energy boost!",
        "Store any leftover energy balls in the refrigerator for up to a week."
      ],
      "ingredients": [
        {
          "ingredient": "Pistachios",
          "unit": "cups",
          "quantity": 1
        },
        {
          "ingredient": "Dried cranberries",
          "unit": "cups",
          "quantity": 0.5
        },
        {
          "ingredient": "Medjool dates, pitted",
          "unit": "cups",
          "quantity": 1
        },
        {
          "ingredient": "Rolled oats",
          "unit": "cups",
          "quantity": 0.5
        },
        {
          "ingredient": "Chia seeds",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Vanilla extract",
          "unit": "teaspoon",
          "quantity": 1
        },
        {
          "ingredient": "Water",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Shredded coconut (for rolling, optional)",
          "unit": "for rolling",
          "quantity": null
        }
      ]
    },
    {
      "title": "Candied Coconut & Cinnamon Pecans",
      "category": "Snack",
      "time": "20 mins",
      "discription": "Candied coconut & cinnamon pecans are a delightful and addictive snack that combines the rich flavor of pecans with the sweet and tropical taste of candied coconut. These oven-roasted pecans are coated in a delicious blend of coconut, cinnamon, and a touch of sweetness, making them a perfect treat for parties or as a homemade gift.",
      "img": "https://cdn.pickuplimes.com/cache/8c/b7/8cb70790fd59cbbd9659c30d3c8c4260.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/64/51/6451d9df4e058bbb2266a12f74225557.jpg",
        "https://cdn.pickuplimes.com/cache/40/2e/402e61a8e432250c2c96a4744a4bfe31.jpg",
        "https://cdn.pickuplimes.com/cache/39/c4/39c4aab576fe611223a44ada705d98e8.jpg",
        "https://cdn.pickuplimes.com/cache/7d/4a/7d4a94d751a55dc277cc7e536876b420.jpg"
      ],
      "directions": [
        "Preheat your oven to 350°F (175°C) and line a baking sheet with parchment paper.",
        "In a bowl, combine the pecans and shredded coconut.",
        "In a separate small bowl, whisk together the melted coconut oil, maple syrup, ground cinnamon, vanilla extract, and salt until well combined.",
        "Pour the coconut oil mixture over the pecans and coconut, and toss them until they are evenly coated.",
        "Spread the coated pecans and coconut in a single layer on the prepared baking sheet.",
        "Bake the candied coconut & cinnamon pecans in the preheated oven for about 10-12 minutes, stirring halfway through the baking time to ensure even coating.",
        "Keep an eye on them to prevent burning, as the coconut can brown quickly.",
        "Remove the baking sheet from the oven and let the pecans cool completely on the sheet.",
        "As they cool, the candied coconut & cinnamon pecans will become crunchy and delicious.",
        "Once cooled, transfer the pecans to an airtight container for storage.",
        "Enjoy these delectable candied coconut & cinnamon pecans as a delightful and irresistible snack or as a topping for salads, desserts, or yogurt!",
        "Store any leftover pecans in an airtight container at room temperature for up to two weeks."
      ],
      "ingredients": [
        {
          "ingredient": "Pecans",
          "unit": "cups",
          "quantity": 2
        },
        {
          "ingredient": "Shredded coconut (unsweetened)",
          "unit": "cups",
          "quantity": 0.5
        },
        {
          "ingredient": "Coconut oil, melted",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Maple syrup",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Ground cinnamon",
          "unit": "teaspoons",
          "quantity": 1
        },
        {
          "ingredient": "Vanilla extract",
          "unit": "teaspoon",
          "quantity": 1
        },
        {
          "ingredient": "Salt",
          "unit": "teaspoon",
          "quantity": 0.25
        }
      ]
    },
    {
      "title": "Nutty Granola Apple Bites",
      "category": "Snack",
      "time": "15 mins",
      "discription": "Nutty granola apple bites are a delicious and healthy snack that combines the natural sweetness of apples with the crunchy and nutty goodness of granola. These bite-sized treats are easy to make and perfect for satisfying your sweet tooth while providing a nutritious boost of fiber and vitamins.",
      "img": "https://cdn.pickuplimes.com/cache/ac/dc/acdcdcdd4d401ef7da72a9c9716a1b1b.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/23/3c/233cd84b8e4cf7767c314b48b2754d68.jpg",
        "https://cdn.pickuplimes.com/cache/4a/c6/4ac633ba696c332845b6267bfe63f832.jpg",
        "https://cdn.pickuplimes.com/cache/70/4a/704a0c20212a0af800c078fa49dd44ae.jpg",
        "https://cdn.pickuplimes.com/cache/ca/84/ca8428771c6392b4ef5a79aafdd54b23.jpg"
      ],
      "directions": [
        "Wash the apples and slice them horizontally into rounds, about 1/2 inch thick.",
        "Using a small cookie cutter or a knife, remove the core and seeds from each apple round to create a small hole in the center.",
        "Spread a thin layer of creamy nut butter on each apple round, covering the entire surface.",
        "Sprinkle the granola, chopped nuts, and dried cranberries or raisins over the nut butter layer on each apple round.",
        "If desired, drizzle a little honey or maple syrup over the toppings for added sweetness.",
        "Arrange the nutty granola apple bites on a serving platter and enjoy them immediately.",
        "These delicious and nutritious bites can be made ahead of time and stored in the refrigerator until serving.",
        "Serve the nutty granola apple bites as a delightful and satisfying snack or a fun addition to any party or gathering!",
        "Feel free to get creative with the toppings and use different types of granola, nuts, and dried fruits for variety."
      ],
      "ingredients": [
        {
          "ingredient": "Apples (any crisp variety)",
          "unit": "medium-sized",
          "quantity": 3
        },
        {
          "ingredient": "Creamy nut butter (such as almond or peanut)",
          "unit": "cups",
          "quantity": 0.5
        },
        {
          "ingredient": "Granola (homemade or store-bought)",
          "unit": "cups",
          "quantity": 0.5
        },
        {
          "ingredient": "Chopped nuts (such as almonds or walnuts)",
          "unit": "cups",
          "quantity": 0.25
        },
        {
          "ingredient": "Dried cranberries or raisins",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Honey or maple syrup (for drizzling, optional)",
          "unit": "for drizzling",
          "quantity": null
        }
      ]
    },
    {
      "title": "Watermelon Pizza",
      "category": "Snack",
      "time": "15 mins",
      "discription": "Watermelon pizza is a refreshing and creative summer treat that puts a fun twist on a classic fruit. This no-bake dessert resembles a pizza, but instead of a dough crust, it features a juicy slice of watermelon topped with a variety of fresh fruits, nuts, and a drizzle of honey or a sprinkle of coconut. It's a delightful and healthy dessert option for hot days.",
      "img": "https://cdn.pickuplimes.com/cache/f3/8b/f38b3984d1892de875162331b8292859.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/4f/70/4f7022b381e1d17f9a81390e3909d133.jpg",
        "https://cdn.pickuplimes.com/cache/9d/74/9d7421a420b5b5ad46e06d501a354b27.jpg",
        "https://cdn.pickuplimes.com/cache/4f/70/4f7022b381e1d17f9a81390e3909d133.jpg",
        "https://cdn.pickuplimes.com/cache/9d/74/9d7421a420b5b5ad46e06d501a354b27.jpg"
      ],
      "directions": [
        "Using a sharp knife, slice the watermelon into round slices, about 1 inch thick, to resemble a pizza crust.",
        "Place the watermelon rounds on a serving platter or a large plate.",
        "Arrange a colorful assortment of fresh berries, such as strawberries, blueberries, and raspberries, on top of the watermelon rounds.",
        "Add sliced kiwi to the watermelon pizza for a burst of color and tangy flavor.",
        "For added freshness, garnish the watermelon pizza with a few fresh mint leaves.",
        "If desired, drizzle a little honey or maple syrup over the fruit toppings for a touch of sweetness.",
        "For additional texture and flavor, consider sprinkling some shredded coconut or chopped nuts on top of the watermelon pizza.",
        "Serve the watermelon pizza immediately or refrigerate it briefly before serving for a chilled and refreshing dessert.",
        "Enjoy this delightful and healthy watermelon pizza as a fun summer treat or a unique addition to any party or barbecue!",
        "Feel free to get creative with the toppings and use a variety of fresh fruits and other toppings to suit your taste preferences."
      ],
      "ingredients": [
        {
          "ingredient": "Watermelon (seedless)",
          "unit": "1",
          "quantity": null
        },
        {
          "ingredient": "Fresh berries (such as strawberries, blueberries, raspberries)",
          "unit": "cups",
          "quantity": null
        },
        {
          "ingredient": "Kiwi, sliced",
          "unit": "1",
          "quantity": null
        },
        {
          "ingredient": "Fresh mint leaves",
          "unit": "for garnish",
          "quantity": null
        },
        {
          "ingredient": "Honey or maple syrup (optional, for drizzling)",
          "unit": "for drizzling",
          "quantity": null
        },
        {
          "ingredient": "Shredded coconut or chopped nuts (optional, for topping)",
          "unit": "for topping",
          "quantity": null
        }
      ]
    },
    {
      "title": "Roasted Edamame: 2 Ways",
      "category": "Snack",
      "time": "25 mins",
      "discription": "Roasted edamame: 2 ways is a versatile and flavorful snack that features two delicious variations of roasted edamame. Edamame, young soybeans, are roasted to perfection with savory seasonings, creating a crunchy and protein-packed snack that's perfect for munching on any time of the day.",
      "img": "https://cdn.pickuplimes.com/cache/37/93/37938875d7955a1aab21263e1a97f20a.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/eb/86/eb8699b454b55921215cfbd38d934ef1.jpg",
        "https://cdn.pickuplimes.com/cache/0c/3c/0c3c2ba0722309c8dbec5965d4c7b0ac.jpg",
        "https://cdn.pickuplimes.com/cache/2e/f4/2ef468e76a3bbcd3d6aca09ebaec6b4c.jpg",
        "https://cdn.pickuplimes.com/cache/02/f8/02f8d6595cef17767c9fc5338f8219a9.jpg"
      ],
      "directions": [
        "Preheat your oven to 425°F (220°C) and line a baking sheet with parchment paper.",
        "In a bowl, combine the thawed edamame, olive oil, soy sauce, garlic powder, onion powder, sesame seeds, chili powder, and salt.",
        "Toss the edamame in the seasonings until they are evenly coated.",
        "For the first variation, spread the seasoned edamame in a single layer on the prepared baking sheet.",
        "Roast the edamame in the preheated oven for about 15-20 minutes or until they become golden brown and crispy, stirring them halfway through the cooking time.",
        "For the second variation, add a touch of sweetness by sprinkling a little brown sugar or maple syrup over the seasoned edamame before roasting.",
        "Spread the edamame in a single layer on the prepared baking sheet.",
        "Roast the sweet and savory edamame in the preheated oven for about 15-20 minutes or until they become golden brown and crispy, stirring them halfway through the cooking time.",
        "Remove the roasted edamame from the oven and let them cool slightly before serving.",
        "Enjoy the roasted edamame as a crunchy and flavorful snack or as a tasty addition to salads and grain bowls.",
        "Store any leftover roasted edamame in an airtight container at room temperature for up to a week.",
        "Feel free to adjust the seasonings to suit your taste preferences and create your own unique variations of roasted edamame."
      ],
      "ingredients": [
        {
          "ingredient": "Frozen edamame, thawed",
          "unit": "cups",
          "quantity": 2
        },
        {
          "ingredient": "Olive oil",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Soy sauce",
          "unit": "tablespoons",
          "quantity": 1
        },
        {
          "ingredient": "Garlic powder",
          "unit": "teaspoon",
          "quantity": 0.5
        },
        {
          "ingredient": "Onion powder",
          "unit": "teaspoon",
          "quantity": 0.5
        },
        {
          "ingredient": "Sesame seeds",
          "unit": "tablespoons",
          "quantity": 1
        },
        {
          "ingredient": "Chili powder",
          "unit": "teaspoon",
          "quantity": 0.5
        },
        {
          "ingredient": "Salt",
          "unit": "teaspoon",
          "quantity": 0.5
        }
      ]
    },
    {
      "title": "Savoury Sun-Dried Tomato & Olive Muffins",
      "category": "Snack",
      "time": "30 mins",
      "discription": "Savory sun-dried tomato & olive muffins are a delicious and flavorful treat that brings together the tangy taste of sun-dried tomatoes and the briny goodness of olives in a moist and savory muffin. These muffins are perfect for breakfast, brunch, or as a delightful accompaniment to soups and salads.",
      "img": "https://cdn.pickuplimes.com/cache/46/0c/460c5dba80e73cd4d794bcf6cc98334f.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/58/6f/586f3bf0c0d5824c9c09ff2bd6675613.jpg",
        "https://cdn.pickuplimes.com/cache/b4/7f/b47fbaa847c59479178fbc1c104ea042.jpg",
        "https://cdn.pickuplimes.com/cache/c0/10/c0103a10dbd1dcda99721c14e8c32d39.jpg",
        "https://cdn.pickuplimes.com/cache/ad/8a/ad8a86f2a7d83265d4e631aaa9b9190e.jpg"
      ],
      "directions": [
        "Preheat your oven to 375°F (190°C) and line a muffin tin with paper liners or grease it with olive oil.",
        "In a large mixing bowl, whisk together the all-purpose flour, baking powder, baking soda, and salt.",
        "In a separate bowl, combine the flaxseed meal and water, and let it sit for a few minutes to form a flax egg.",
        "To the flax egg, add the olive oil and unsweetened almond milk, and whisk everything together.",
        "Pour the wet ingredients into the bowl with the dry ingredients and stir until just combined.",
        "Fold in the chopped sun-dried tomatoes, Kalamata olives, chopped fresh basil leaves, nutritional yeast, garlic powder, and black pepper.",
        "Scoop the muffin batter into the prepared muffin tin, filling each cup about 2/3 full.",
        "Bake the savory sun-dried tomato & olive muffins in the preheated oven for about 15-18 minutes or until a toothpick inserted into the center of a muffin comes out clean.",
        "Remove the muffins from the oven and let them cool in the muffin tin for a few minutes before transferring them to a wire rack to cool completely.",
        "Serve these delightful savory muffins warm or at room temperature as a tasty and satisfying snack or side dish.",
        "Any leftover muffins can be stored in an airtight container at room temperature for up to three days or in the refrigerator for up to a week.",
        "Enjoy the savory sun-dried tomato & olive muffins with your favorite spreads or simply on their own for a flavorful treat!"
      ],
      "ingredients": [
        {
          "ingredient": "All-purpose flour",
          "unit": "cups",
          "quantity": 2
        },
        {
          "ingredient": "Baking powder",
          "unit": "teaspoons",
          "quantity": 2
        },
        {
          "ingredient": "Baking soda",
          "unit": "teaspoon",
          "quantity": 0.5
        },
        {
          "ingredient": "Salt",
          "unit": "teaspoon",
          "quantity": 0.5
        },
        {
          "ingredient": "Olive oil",
          "unit": "cup",
          "quantity": 0.5
        },
        {
          "ingredient": "Unsweetened almond milk (or any plant-based milk)",
          "unit": "cup",
          "quantity": 1
        },
        {
          "ingredient": "Flaxseed meal",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Water",
          "unit": "tablespoons",
          "quantity": 6
        },
        {
          "ingredient": "Sun-dried tomatoes, chopped",
          "unit": "cup",
          "quantity": 0.5
        },
        {
          "ingredient": "Kalamata olives, pitted and chopped",
          "unit": "cup",
          "quantity": 0.5
        },
        {
          "ingredient": "Fresh basil leaves, chopped",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Nutritional yeast",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Garlic powder",
          "unit": "teaspoon",
          "quantity": 0.5
        },
        {
          "ingredient": "Black pepper",
          "unit": "teaspoon",
          "quantity": 0.25
        }
      ]
    },
    {
      "title": "Crunchy Pecan & Cranberry Granola",
      "category": "Snack",
      "time": "25 mins",
      "discription": "Crunchy pecan & cranberry granola is a delicious and nutritious homemade cereal that combines the rich flavor of pecans with the tartness of dried cranberries. This granola is loaded with wholesome oats, nuts, seeds, and sweetened with a touch of maple syrup, creating a delightful and crunchy treat to enjoy with yogurt, milk, or as a snack on its own.",
      "img": "https://cdn.pickuplimes.com/cache/23/59/23596901ac89541835865af46c94d1e1.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/bb/77/bb779ae4af121edff7ead323f55a1cf3.jpg",
        "https://cdn.pickuplimes.com/cache/55/98/559878a2dce0ec9deb0a1188d600371b.jpg",
        "https://cdn.pickuplimes.com/cache/39/bf/39bfebd0adae8e60926a9d1e789042fd.jpg",
        "https://cdn.pickuplimes.com/cache/a2/ab/a2ab158b204114cd5147b208d0debc69.jpg"
      ],
      "directions": [
        "Preheat your oven to 325°F (160°C) and line a large baking sheet with parchment paper.",
        "In a large mixing bowl, combine the old-fashioned rolled oats, chopped pecans, dried cranberries, unsweetened shredded coconut, pumpkin seeds, ground cinnamon, and salt.",
        "In a separate small bowl, whisk together the maple syrup, melted coconut oil, and vanilla extract.",
        "Pour the wet ingredients over the dry ingredients in the large mixing bowl.",
        "Stir well until all the dry ingredients are coated with the wet mixture, ensuring everything is evenly combined.",
        "Spread the granola mixture in an even layer on the prepared baking sheet.",
        "Bake the crunchy pecan & cranberry granola in the preheated oven for about 15-20 minutes or until it turns golden brown and crispy, stirring the mixture every 5 minutes to ensure even toasting.",
        "Keep a close eye on the granola to prevent it from burning.",
        "Remove the baking sheet from the oven and let the granola cool completely on the sheet. It will continue to crisp up as it cools.",
        "Once cooled, transfer the crunchy pecan & cranberry granola to an airtight container for storage.",
        "Enjoy this delightful and nutritious granola with your favorite yogurt, milk, or as a crunchy snack any time of the day!",
        "Store any leftover granola in an airtight container at room temperature for up to two weeks.",
        "Feel free to customize the granola by adding other nuts, seeds, or dried fruits to suit your taste preferences."
      ],
      "ingredients": [
        {
          "ingredient": "Old-fashioned rolled oats",
          "unit": "cups",
          "quantity": 3
        },
        {
          "ingredient": "Pecans, chopped",
          "unit": "cups",
          "quantity": 1
        },
        {
          "ingredient": "Dried cranberries",
          "unit": "cups",
          "quantity": 0.5
        },
        {
          "ingredient": "Unsweetened shredded coconut",
          "unit": "cups",
          "quantity": 0.5
        },
        {
          "ingredient": "Pumpkin seeds (pepitas)",
          "unit": "cups",
          "quantity": 0.25
        },
        {
          "ingredient": "Ground cinnamon",
          "unit": "teaspoon",
          "quantity": 1
        },
        {
          "ingredient": "Salt",
          "unit": "teaspoon",
          "quantity": 0.25
        },
        {
          "ingredient": "Maple syrup",
          "unit": "cup",
          "quantity": 0.5
        },
        {
          "ingredient": "Coconut oil, melted",
          "unit": "tablespoons",
          "quantity": 3
        },
        {
          "ingredient": "Vanilla extract",
          "unit": "teaspoon",
          "quantity": 1
        }
      ]
    },
    {
      "title": "Ranch Flavoured Roasted Chickpeas",
      "category": "Snack",
      "time": "30 mins",
      "discription": "Ranch-flavored roasted chickpeas are a delicious and crunchy snack that packs a punch of savory and zesty flavors. These roasted chickpeas are coated in a homemade ranch seasoning blend and baked to perfection, creating a delightful and protein-packed snack that's perfect for munching on anytime you need a tasty and satisfying treat.",
      "img": "https://cdn.pickuplimes.com/cache/97/32/9732c19f8999ad5e58d47d4b25dfa307.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/43/d8/43d86d94194924d0da63a5aeea075bf8.jpg",
        "https://cdn.pickuplimes.com/cache/c9/bd/c9bda65760ee6b9433ba7dcccf29d74e.jpg",
        "https://cdn.pickuplimes.com/cache/fd/d5/fdd58eb384844fcb843ca20a790d9eda.jpg",
        "https://cdn.pickuplimes.com/cache/b0/27/b027e61c8be34073b0dfc4dcb248a6a6.jpg"
      ],
      "directions": [
        "Preheat your oven to 400°F (200°C) and line a baking sheet with parchment paper.",
        "Rinse and drain the canned chickpeas thoroughly. Pat them dry with a paper towel to remove excess moisture.",
        "In a bowl, toss the chickpeas with olive oil until they are evenly coated.",
        "In a separate small bowl, combine the dried dill, dried parsley, garlic powder, onion powder, dried chives, salt, black pepper, paprika, and a pinch of cayenne pepper if you prefer a bit of heat.",
        "Sprinkle the ranch seasoning mixture over the chickpeas and toss them again to ensure the seasoning is evenly distributed.",
        "Spread the seasoned chickpeas in a single layer on the prepared baking sheet.",
        "Roast the ranch-flavored chickpeas in the preheated oven for about 25-30 minutes or until they become golden brown and crispy, shaking the baking sheet occasionally to prevent sticking.",
        "Keep a close eye on the chickpeas in the last few minutes of roasting to avoid burning.",
        "Remove the baking sheet from the oven and let the roasted chickpeas cool completely on the sheet.",
        "Once cooled, transfer the ranch-flavored roasted chickpeas to an airtight container for storage.",
        "Enjoy these savory and crunchy chickpeas as a delightful and guilt-free snack or as a tasty topping for salads and soups!",
        "Store any leftover roasted chickpeas in an airtight container at room temperature for up to a week.",
        "Feel free to adjust the ranch seasoning to suit your taste preferences, adding more or less of any ingredient as desired."
      ],
      "ingredients": [
        {
          "ingredient": "Canned chickpeas (garbanzo beans)",
          "unit": "2 cans",
          "quantity": null
        },
        {
          "ingredient": "Olive oil",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Dried dill",
          "unit": "teaspoon",
          "quantity": 1
        },
        {
          "ingredient": "Dried parsley",
          "unit": "teaspoon",
          "quantity": 1
        },
        {
          "ingredient": "Garlic powder",
          "unit": "teaspoon",
          "quantity": 0.5
        },
        {
          "ingredient": "Onion powder",
          "unit": "teaspoon",
          "quantity": 0.5
        },
        {
          "ingredient": "Dried chives",
          "unit": "teaspoon",
          "quantity": 0.5
        },
        {
          "ingredient": "Salt",
          "unit": "teaspoon",
          "quantity": 0.5
        },
        {
          "ingredient": "Black pepper",
          "unit": "teaspoon",
          "quantity": 0.25
        },
        {
          "ingredient": "Paprika",
          "unit": "teaspoon",
          "quantity": 0.25
        },
        {
          "ingredient": "Cayenne pepper (optional, for heat)",
          "unit": "pinch",
          "quantity": null
        }
      ]
    },
    {
      "title": "Tropical Coconut Popsicles",
      "category": "Snack",
      "time": "10 mins",
      "discription": "Tropical coconut popsicles are a refreshing and tropical treat that brings the flavors of coconut and various fruits together in a delightful frozen dessert. These homemade popsicles are made with creamy coconut milk, ripe tropical fruits, and a touch of sweetness, creating a cool and creamy popsicle that's perfect for beating the heat on a sunny day.",
      "img": "https://cdn.pickuplimes.com/cache/50/22/50226805dabd3370192ba68e66b81a10.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/82/c3/82c31cc05ebaadedc800cdf3fc443870.jpg",
        "https://cdn.pickuplimes.com/cache/43/03/4303cff2e2096cfd2109d52af0d8dead.jpg",
        "https://cdn.pickuplimes.com/cache/6a/7b/6a7b7a16f5c345233fed9ed73da10097.jpg",
        "https://cdn.pickuplimes.com/cache/92/c8/92c8ea327c17d7dfa38871387b0d0c83.jpg"
      ],
      "directions": [
        "In a blender or food processor, combine the coconut milk, pineapple chunks, mango chunks, kiwi slices, sweetener of choice (start with 2 tablespoons and adjust to your desired level of sweetness), and vanilla extract.",
        "Blend the mixture until it becomes smooth and creamy.",
        "Taste the mixture and adjust the sweetness if needed, adding more sweetener if desired.",
        "If you prefer some texture, stir in the shredded coconut into the mixture.",
        "Pour the tropical coconut mixture into popsicle molds, leaving a little space at the top for expansion during freezing.",
        "If using popsicle sticks, insert them into the molds, ensuring they are centered.",
        "Place the popsicle molds in the freezer and freeze the popsicles for at least 4-6 hours or until they are completely frozen.",
        "Once the tropical coconut popsicles are frozen, remove them from the molds by briefly running the molds under warm water to loosen the popsicles.",
        "Serve the delightful tropical coconut popsicles immediately, or store them in a resealable plastic bag or an airtight container in the freezer for up to a few weeks.",
        "Enjoy these cool and tropical treats whenever you need a refreshing and creamy popsicle to beat the heat!",
        "Feel free to customize the popsicles by adding other tropical fruits like banana, papaya, or passion fruit, according to your taste preferences."
      ],
      "ingredients": [
        {
          "ingredient": "Coconut milk (full-fat)",
          "unit": "1 can (13.5 oz)",
          "quantity": null
        },
        {
          "ingredient": "Pineapple chunks",
          "unit": "1 cup",
          "quantity": null
        },
        {
          "ingredient": "Mango chunks",
          "unit": "1 cup",
          "quantity": null
        },
        {
          "ingredient": "Kiwi slices",
          "unit": "1 cup",
          "quantity": null
        },
        {
          "ingredient": "Sweetener of choice (such as honey or maple syrup)",
          "unit": "2-4 tablespoons",
          "quantity": null
        },
        {
          "ingredient": "Vanilla extract",
          "unit": "1 teaspoon",
          "quantity": null
        },
        {
          "ingredient": "Shredded coconut (optional, for texture)",
          "unit": "2 tablespoons",
          "quantity": null
        }
      ]
    },
    {
      "title": "Super Seed Stuffed Dates",
      "category": "Snack",
      "time": "15 mins",
      "discription": "Super seed stuffed dates are a delicious and nutritious snack that combines the natural sweetness of dates with a crunchy and flavorful mix of super seeds. These stuffed dates are packed with a variety of seeds such as chia, flax, pumpkin, and sunflower seeds, providing a boost of protein, fiber, and essential nutrients. They are perfect for satisfying your sweet cravings while providing a healthy energy boost.",
      "img": "https://cdn.pickuplimes.com/cache/2d/e8/2de851076124ca08c381ec4228092978.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/cd/e3/cde3070c5f44d7608a6a3b641907fee2.jpg",
        "https://cdn.pickuplimes.com/cache/10/c6/10c6fff54f11edfbc32a9f9908b06092.jpg",
        "https://cdn.pickuplimes.com/cache/08/e8/08e823d7318f85598644c27a4624efa8.jpg",
        "https://cdn.pickuplimes.com/cache/96/04/9604e0a9b7a51bdd188cb3737b0abab7.jpg"
      ],
      "directions": [
        "Using a sharp knife, make a lengthwise cut along one side of each Medjool date to create an opening for stuffing.",
        "Remove the pits from the dates, if necessary.",
        "In a small bowl, mix together the chia seeds, flax seeds, pumpkin seeds, sunflower seeds, almond butter, shredded coconut, and cinnamon (if using).",
        "Scoop about a teaspoon of the super seed mixture into each date, pressing it gently to fill the cavity.",
        "If the dates don't close completely after stuffing, you can use your fingers to gently press the sides together.",
        "Once all the dates are stuffed, they are ready to be enjoyed!",
        "These super seed stuffed dates make for a delightful and nutritious snack that's perfect for satisfying your sweet tooth and providing a quick energy boost.",
        "Store any leftover stuffed dates in an airtight container in the refrigerator for up to a week.",
        "Feel free to experiment with the seed mixture and use your favorite combination of seeds and nuts for the stuffing."
      ],
      "ingredients": [
        {
          "ingredient": "Medjool dates",
          "unit": "10",
          "quantity": null
        },
        {
          "ingredient": "Chia seeds",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Flax seeds",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Pumpkin seeds",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Sunflower seeds",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Almond butter (or any nut butter of choice)",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Unsweetened shredded coconut",
          "unit": "tablespoons",
          "quantity": 2
        },
        {
          "ingredient": "Cinnamon (optional, for added flavor)",
          "unit": "teaspoon",
          "quantity": null
        }
      ]
    },
    {
      "title": "Crunchy Sesame Snaps",
      "category": "Snack",
      "time": "25 mins",
      "discription": "Crunchy sesame snaps are a delightful and addictive treat that combines the nutty flavor of sesame seeds with a sweet and caramelized texture. These homemade sesame snaps are easy to make and provide a satisfying crunch that's perfect for snacking or as a delicious addition to desserts and ice creams.",
      "img": "https://cdn.pickuplimes.com/cache/1c/66/1c66f4c200e84cfabb4ce2499ddd8f9d.jpg",
      "images": [
        "https://cdn.pickuplimes.com/cache/45/fb/45fbf5dee2bdfe1723899ef9dac1e981.jpg",
        "https://cdn.pickuplimes.com/cache/f3/c4/f3c4b8a519383effc3f21ef8fa0189fc.jpg",
        "https://cdn.pickuplimes.com/cache/94/68/94688307e28a8d0adcd22925a6f96d7e.jpg",
        "https://cdn.pickuplimes.com/cache/3e/4e/3e4ede678295179d4f4c23fc2b8cc15d.jpg"
      ],
      "directions": [
        "Preheat your oven to 350°F (175°C) and line a baking sheet with parchment paper.",
        "In a dry skillet over medium heat, toast the white sesame seeds for about 3-4 minutes or until they turn lightly golden and fragrant. Stir them constantly to prevent burning.",
        "In a saucepan, combine the honey, granulated sugar, unsalted butter, vanilla extract, and salt. Cook over medium heat, stirring constantly until the mixture becomes smooth and starts to bubble.",
        "Add the toasted sesame seeds to the saucepan and stir well to evenly coat the seeds with the caramel mixture.",
        "Quickly pour the sesame mixture onto the prepared baking sheet and spread it out into a thin and even layer using a spatula or the back of a spoon.",
        "Bake the sesame mixture in the preheated oven for about 8-10 minutes or until it turns golden brown around the edges.",
        "Keep a close eye on the sesame snaps in the last few minutes of baking to avoid over-browning.",
        "Remove the baking sheet from the oven and let the sesame mixture cool for a few minutes to firm up.",
        "While it's still warm, cut the sesame snaps into desired shapes using a sharp knife or break them into irregular pieces for a rustic look.",
        "Allow the sesame snaps to cool completely on the baking sheet until they become firm and crunchy.",
        "Once cooled, the sesame snaps are ready to be enjoyed as a delicious and addictive snack or as a crunchy topping for desserts and ice creams.",
        "Store any leftover sesame snaps in an airtight container at room temperature for up to a week.",
        "Feel free to customize the sesame snaps by adding other ingredients like chopped nuts, dried fruits, or a sprinkle of sea salt to suit your taste preferences."
      ],
      "ingredients": [
        {
          "ingredient": "White sesame seeds",
          "unit": "1 cup",
          "quantity": null
        },
        {
          "ingredient": "Honey",
          "unit": "1/3 cup",
          "quantity": null
        },
        {
          "ingredient": "Granulated sugar",
          "unit": "1/4 cup",
          "quantity": null
        },
        {
          "ingredient": "Unsalted butter",
          "unit": "2 tablespoons",
          "quantity": null
        },
        {
          "ingredient": "Vanilla extract",
          "unit": "1/2 teaspoon",
          "quantity": null
        },
        {
          "ingredient": "Salt",
          "unit": "1/4 teaspoon",
          "quantity": null
        }
      ]
    }
  ]
}
